uploads/xml/Travelport-Request-665b6ab870358-3735.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:LowFareSearchReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:com="http://www.travelport.com/schema/common_v51_0" SolutionResult="false" TargetBranch="P3763969" TraceId="11d31fcfc9927c18ef75f5c5da10e0d4">
      <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="DUS"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="PMI"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2025-03-16">
          <com:SearchExtraDays DaysBefore="3" DaysAfter="3"/>
        </air:SearchDepTime>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="PMI"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="DUS"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2025-03-26">
          <com:SearchExtraDays DaysBefore="3" DaysAfter="3"/>
        </air:SearchDepTime>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:AirSearchModifiers>
        <air:PreferredProviders>
          <com:Provider Code="1G"/>
        </air:PreferredProviders>
        <air:FlightType NonStopDirects="true"/>
      </air:AirSearchModifiers>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <air:AirPricingModifiers CurrencyType="SAR"/>
    </air:LowFareSearchReq>
  </soapenv:Body>
</soapenv:Envelope>
